Pandas is fast, flexible ,most powerful, and  easy to use open source library. It is used for data analysis, ans data manipulation , built on top of python programming. Pandas would be 2-D array

Pandas Series  is like a column in a table. It's 1-D array

In [232]:
import pandas as pd
import numpy as np

### Read the Data

In [233]:
data = pd.read_csv('employees.csv')
data.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [234]:
### Delete the COMMISSION_PCT column

In [235]:
data.drop('COMMISSION_PCT',axis=1,inplace=True)
data.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,201,20

In [236]:
### Series Using String

In [237]:
job_id = data.iloc[:,-4]

In [238]:
type(job_id)

pandas.core.series.Series

In [239]:
job_id

0       SH_CLERK
1       SH_CLERK
2        AD_ASST
3         MK_MAN
4         MK_REP
5         HR_REP
6         PR_REP
7         AC_MGR
8     AC_ACCOUNT
9        AD_PRES
10         AD_VP
11         AD_VP
12       IT_PROG
13       IT_PROG
14       IT_PROG
15       IT_PROG
16       IT_PROG
17        FI_MGR
18    FI_ACCOUNT
19    FI_ACCOUNT
20    FI_ACCOUNT
21    FI_ACCOUNT
22    FI_ACCOUNT
23        PU_MAN
24      PU_CLERK
25      PU_CLERK
26      PU_CLERK
27      PU_CLERK
28      PU_CLERK
29        ST_MAN
30        ST_MAN
31        ST_MAN
32        ST_MAN
33        ST_MAN
34      ST_CLERK
35      ST_CLERK
36      ST_CLERK
37      ST_CLERK
38      ST_CLERK
39      ST_CLERK
40      ST_CLERK
41      ST_CLERK
42      ST_CLERK
43      ST_CLERK
44      ST_CLERK
45      ST_CLERK
46      ST_CLERK
47      ST_CLERK
48      ST_CLERK
49      ST_CLERK
Name: JOB_ID, dtype: object

In [240]:
type(data)

pandas.core.frame.DataFrame

In [241]:
# It's count the values
data.value_counts()

EMPLOYEE_ID  FIRST_NAME   LAST_NAME    EMAIL     PHONE_NUMBER  HIRE_DATE  JOB_ID      SALARY  MANAGER_ID  DEPARTMENT_ID
206          William      Gietz        WGIETZ    515.123.8181  07-JUN-02  AC_ACCOUNT  8300    205         110              1
112          Jose Manuel  Urman        JMURMAN   515.124.4469  07-MAR-06  FI_ACCOUNT  7800    108         100              1
122          Payam        Kaufling     PKAUFLIN  650.123.3234  01-MAY-03  ST_MAN      7900    100         50               1
121          Adam         Fripp        AFRIPP    650.123.2234  10-APR-05  ST_MAN      8200    100         50               1
120          Matthew      Weiss        MWEISS    650.123.1234  18-JUL-04  ST_MAN      8000    100         50               1
119          Karen        Colmenares   KCOLMENA  515.127.4566  10-AUG-07  PU_CLERK    2500    114         30               1
118          Guy          Himuro       GHIMURO   515.127.4565  15-NOV-06  PU_CLERK    2600    114         30               1
117          Sigal        Tobias       STOBIAS   515.127.4564  24-JUL-05  PU_CLERK    2800    114         30               1
116          Shelli       Baida        SBAIDA    515.127.4563  24-DEC-05  PU_CLERK    2900    114         30               1
115          Alexander    Khoo         AKHOO     515.127.4562  18-MAY-03  PU_CLERK    3100    114         30               1
114          Den          Raphaely     DRAPHEAL  515.127.4561  07-DEC-02  PU_MAN      11000   100         30               1
113          Luis         Popp         LPOPP     515.124.4567  07-DEC-07  FI_ACCOUNT  6900    108         100              1
111          Ismael       Sciarra      ISCIARRA  515.124.4369  30-SEP-05  FI_ACCOUNT  7700    108         100              1
205          Shelley      Higgins      SHIGGINS  515.123.8080  07-JUN-02  AC_MGR      12008   101         110              1
110          John         Chen         JCHEN     515.124.4269  28-SEP-05  FI_ACCOUNT  8200    108         100              1
109          Daniel       Faviet       DFAVIET   515.124.4169  16-AUG-02  FI_ACCOUNT  9000    108         100              1
108          Nancy        Greenberg    NGREENBE  515.124.4569  17-AUG-02  FI_MGR      12008   101         100              1
107          Diana        Lorentz      DLORENTZ  590.423.5567  07-FEB-07  IT_PROG     4200    103         60               1
106          Valli        Pataballa    VPATABAL  590.423.4560  05-FEB-06  IT_PROG     4800    103         60               1
105          David        Austin       DAUSTIN   590.423.4569  25-JUN-05  IT_PROG     4800    103         60               1
104          Bruce        Ernst        BERNST    590.423.4568  21-MAY-07  IT_PROG     6000    103         60               1
103          Alexander    Hunold       AHUNOLD   590.423.4567  03-JAN-06  IT_PROG     9000    102         60               1
102          Lex          De Haan      LDEHAAN   515.123.4569  13-JAN-01  AD_VP       17000   100         90               1
101          Neena        Kochhar      NKOCHHAR  515.123.4568  21-SEP-05  AD_VP       17000   100         90               1
123          Shanta       Vollman      SVOLLMAN  650.123.4234  10-OCT-05  ST_MAN      6500    100         50               1
124          Kevin        Mourgos      KMOURGOS  650.123.5234  16-NOV-07  ST_MAN      5800    100         50               1
125          Julia        Nayer        JNAYER    650.124.1214  16-JUL-05  ST_CLERK    3200    120         50               1
126          Irene        Mikkilineni  IMIKKILI  650.124.1224  28-SEP-06  ST_CLERK    2700    120         50               1
204          Hermann      Baer         HBAER     515.123.8888  07-JUN-02  PR_REP      10000   101         70               1
203          Susan        Mavris       SMAVRIS   515.123.7777  07-JUN-02  HR_REP      6500    101         40               1
202          Pat          Fay          PFAY      603.123.6666  17-AUG-05  MK_REP      6000    201         20               1
201          Michael      Hartstein    MHARTSTE  515.123.5555  17-FEB-04  MK_MAN      13000   100         20               1
200          Jennifer     Whalen       JWHALEN   515.123.4444  17-SEP-03  AD_ASST     4400    101         10               1
199          Douglas      Grant        DGRANT    650.507.9844  13-JAN-08  SH_CLERK    2600    124         50               1
198          Donald       OConnell     DOCONNEL  650.507.9833  21-JUN-07  SH_CLERK    2600    124         50               1
140          Joshua       Patel        JPATEL    650.121.1834  06-APR-06  ST_CLERK    2500    123         50               1
139          John         Seo          JSEO      650.121.2019  12-FEB-06  ST_CLERK    2700    123         50               1
138          Stephen      Stiles       SSTILES   650.121.2034  26-OCT-05  ST_CLERK    3200    123         50               1
137          Renske       Ladwig       RLADWIG   650.121.1234  14-JUL-03  ST_CLERK    3600    123         50               1
136          Hazel        Philtanker   HPHILTAN  650.127.1634  06-FEB-08  ST_CLERK    2200    122         50               1
135          Ki           Gee          KGEE      650.127.1734  12-DEC-07  ST_CLERK    2400    122         50               1
134          Michael      Rogers       MROGERS   650.127.1834  26-AUG-06  ST_CLERK    2900    122         50               1
133          Jason        Mallin       JMALLIN   650.127.1934  14-JUN-04  ST_CLERK    3300    122         50               1
132          TJ           Olson        TJOLSON   650.124.8234  10-APR-07  ST_CLERK    2100    121         50               1
131          James        Marlow       JAMRLOW   650.124.7234  16-FEB-05  ST_CLERK    2500    121         50               1
130          Mozhe        Atkinson     MATKINSO  650.124.6234  30-OCT-05  ST_CLERK    2800    121         50               1
129          Laura        Bissot       LBISSOT   650.124.5234  20-AUG-05  ST_CLERK    3300    121         50               1
128          Steven       Markle       SMARKLE   650.124.1434  08-MAR-08  ST_CLERK    2200    120         50               1
127          James        Landry       JLANDRY   650.124.1334  14-JAN-07  ST_CLERK    2400    120         50               1
100          Steven       King         SKING     515.123.4567  17-JUN-03  AD_PRES     24000    -          90               1
dtype: int64

In [242]:
# total numbers of record
data.shape

(50, 10)

In [243]:
# find the datatype of each columns in the records
data.dtypes

EMPLOYEE_ID       int64
FIRST_NAME       object
LAST_NAME        object
EMAIL            object
PHONE_NUMBER     object
HIRE_DATE        object
JOB_ID           object
SALARY            int64
MANAGER_ID       object
DEPARTMENT_ID     int64
dtype: object

In [244]:
# take all the object type variable
data.select_dtypes(include='object').head()

,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,MANAGER_ID
0,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,124
1,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,124
2,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,101
3,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,100
4,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,201

In [245]:
# Only the values in the DataFrame will be returned
data.values

array([[198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833',
        '21-JUN-07', 'SH_CLERK', 2600, '124', 50],
       [199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', '13-JAN-08',
        'SH_CLERK', 2600, '124', 50],
       [200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444',
        '17-SEP-03', 'AD_ASST', 4400, '101', 10],
       [201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555',
        '17-FEB-04', 'MK_MAN', 13000, '100', 20],
       [202, 'Pat', 'Fay', 'PFAY', '603.123.6666', '17-AUG-05', 'MK_REP',
        6000, '201', 20],
       [203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '07-JUN-02',
        'HR_REP', 6500, '101', 40],
       [204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', '07-JUN-02',
        'PR_REP', 10000, '101', 70],
       [205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080',
        '07-JUN-02', 'AC_MGR', 12008, '101', 110],
       [206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '07-JUN-02',
        'AC_ACCOUNT', 8300, '205', 110],
       [100, 'Steven', 'King', 'SKING', '515.123.4567', '17-JUN-03',
        'AD_PRES', 24000, ' - ', 90],
       [101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '21-SEP-05',
        'AD_VP', 17000, '100', 90],
       [102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '13-JAN-01',
        'AD_VP', 17000, '100', 90],
       [103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567',
        '03-JAN-06', 'IT_PROG', 9000, '102', 60],
       [104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '21-MAY-07',
        'IT_PROG', 6000, '103', 60],
       [105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', '25-JUN-05',
        'IT_PROG', 4800, '103', 60],
       [106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560',
        '05-FEB-06', 'IT_PROG', 4800, '103', 60],
       [107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', '07-FEB-07',
        'IT_PROG', 4200, '103', 60],
       [108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569',
        '17-AUG-02', 'FI_MGR', 12008, '101', 100],
       [109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', '16-AUG-02',
        'FI_ACCOUNT', 9000, '108', 100],
       [110, 'John', 'Chen', 'JCHEN', '515.124.4269', '28-SEP-05',
        'FI_ACCOUNT', 8200, '108', 100],
       [111, 'Ismael', 'Sciarra', 'ISCIARRA', '515.124.4369',
        '30-SEP-05', 'FI_ACCOUNT', 7700, '108', 100],
       [112, 'Jose Manuel', 'Urman', 'JMURMAN', '515.124.4469',
        '07-MAR-06', 'FI_ACCOUNT', 7800, '108', 100],
       [113, 'Luis', 'Popp', 'LPOPP', '515.124.4567', '07-DEC-07',
        'FI_ACCOUNT', 6900, '108', 100],
       [114, 'Den', 'Raphaely', 'DRAPHEAL', '515.127.4561', '07-DEC-02',
        'PU_MAN', 11000, '100', 30],
       [115, 'Alexander', 'Khoo', 'AKHOO', '515.127.4562', '18-MAY-03',
        'PU_CLERK', 3100, '114', 30],
       [116, 'Shelli', 'Baida', 'SBAIDA', '515.127.4563', '24-DEC-05',
        'PU_CLERK', 2900, '114', 30],
       [117, 'Sigal', 'Tobias', 'STOBIAS', '515.127.4564', '24-JUL-05',
        'PU_CLERK', 2800, '114', 30],
       [118, 'Guy', 'Himuro', 'GHIMURO', '515.127.4565', '15-NOV-06',
        'PU_CLERK', 2600, '114', 30],
       [119, 'Karen', 'Colmenares', 'KCOLMENA', '515.127.4566',
        '10-AUG-07', 'PU_CLERK', 2500, '114', 30],
       [120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', '18-JUL-04',
        'ST_MAN', 8000, '100', 50],
       [121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', '10-APR-05',
        'ST_MAN', 8200, '100', 50],
       [122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234',
        '01-MAY-03', 'ST_MAN', 7900, '100', 50],
       [123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234',
        '10-OCT-05', 'ST_MAN', 6500, '100', 50],
       [124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', '16-NOV-07',
        'ST_MAN', 5800, '100', 50],
       [125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', '16-JUL-05',
        'ST_CLERK', 3200, '120', 50],
       [126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224',
        '28-SEP-06', 'ST_CLERK', 2700, '120', 50],
       [127, 'James', 'Landry', 'JLANDRY', '650.124.1334', '14-JAN-07',
        'ST_CLERK', 2400, '120', 50],
       [128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', '08-MAR-08',
        'ST_CLERK', 2200, '120', 50],
       [129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', '20-AUG-05',
        'ST_CLERK', 3300, '121', 50],
       [130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234',
        '30-OCT-05', 'ST_CLERK', 2800, '121', 50],
       [131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', '16-FEB-05',
        'ST_CLERK', 2500, '121', 50],
       [132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', '10-APR-07',
        'ST_CLERK', 2100, '121', 50],
       [133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', '14-JUN-04',
        'ST_CLERK', 3300, '122', 50],
       [134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', '26-AUG-06',
        'ST_CLERK', 2900, '122', 50],
       [135, 'Ki', 'Gee', 'KGEE', '650.127.1734', '12-DEC-07',
        'ST_CLERK', 2400, '122', 50],
       [136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634',
        '06-FEB-08', 'ST_CLERK', 2200, '122', 50],
       [137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', '14-JUL-03',
        'ST_CLERK', 3600, '123', 50],
       [138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', '26-OCT-05',
        'ST_CLERK', 3200, '123', 50],
       [139, 'John', 'Seo', 'JSEO', '650.121.2019', '12-FEB-06',
        'ST_CLERK', 2700, '123', 50],
       [140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', '06-APR-06',
        'ST_CLERK', 2500, '123', 50]], dtype=object)

In [246]:
# Return 1 if Series otherwise return 2 if DataFrame
data.ndim

2

In [247]:
# Return the memory usage of each column in dataframe in "byte"
data.memory_usage()

Index            128
EMPLOYEE_ID      400
FIRST_NAME       400
LAST_NAME        400
EMAIL            400
PHONE_NUMBER     400
HIRE_DATE        400
JOB_ID           400
SALARY           400
MANAGER_ID       400
DEPARTMENT_ID    400
dtype: int64

In [248]:
# if we want to remove index
data.memory_usage(index=False)

EMPLOYEE_ID      400
FIRST_NAME       400
LAST_NAME        400
EMAIL            400
PHONE_NUMBER     400
HIRE_DATE        400
JOB_ID           400
SALARY           400
MANAGER_ID       400
DEPARTMENT_ID    400
dtype: int64

In [249]:
# We want to check data with FIRST_NAME = Meera and LAST_NAME = "Sharma"

data.isin({'FIRST_NAME': ['Mera','Donald'],'LAST_NAME':['Sharma','Grant']}).head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
0,False,True,False,False,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [250]:
# There is another way to check the below list of salary is existing in the dataframe/ To retrieve the record of given list of
# salary from dataframe

new=data['SALARY'].isin([20000,30000,6000,13000])

In [251]:
data[new]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,201,20
13,104,Bruce,Ernst,BERNST,590.423.4568,21-MAY-07,IT_PROG,6000,103,60

#### Based on above record we are able to see that records are not there of salary 20000 and 30000.

### .loc: Access a group of row and columns by label(s) or boolean array. Multiple Conditional related problems work on .loc method

####  Scenario 1 : Returns all the records between FIRST_NAME and EMAIL

In [252]:
data.columns

Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
       'HIRE_DATE', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEPARTMENT_ID'],
      dtype='object')

In [253]:
data.loc[:,'FIRST_NAME':'EMAIL'].head()

  FIRST_NAME  LAST_NAME     EMAIL
0     Donald   OConnell  DOCONNEL
1    Douglas      Grant    DGRANT
2   Jennifer     Whalen   JWHALEN
3    Michael  Hartstein  MHARTSTE
4        Pat        Fay      PFAY

#### Scenario 2 : a. Return the records where Salary > 6000

In [254]:
data.loc[data['SALARY']>6000]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,100,20
5,203,Susan,Mavris,SMAVRIS,515.123.7777,07-JUN-02,HR_REP,6500,101,40
6,204,Hermann,Baer,HBAER,515.123.8888,07-JUN-02,PR_REP,10000,101,70
7,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-JUN-02,AC_MGR,12008,101,110
8,206,William,Gietz,WGIETZ,515.123.8181,07-JUN-02,AC_ACCOUNT,8300,205,110
9,100,Steven,King,SKING,515.123.4567,17-JUN-03,AD_PRES,24000,-,90
10,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-SEP-05,AD_VP,17000,100,90
11,102,Lex,De Haan,LDEHAAN,515.123.4569,13-JAN-01,AD_VP,17000,100,90
12,103,Alexander,Hunold,AHUNOLD,590.423.4567,03-JAN-06,IT_PROG,9000,102,60
17,108,Nancy,Greenberg,NGREENBE,515.124.4569,17-AUG-02,FI_MGR,12008,101,100
18,109,Daniel,Faviet,DFAVIET,515.124.4169,16-AUG-02,FI_ACCOUNT,9000,108,100
19,110,John,Chen,JCHEN,515.124.4269,28-SEP-05,FI_ACCOUNT,8200,108,100
20,111,Ismael,Sciarra,ISCIARRA,515.124.4369,30-SEP-05,FI_ACCOUNT,7700,108,100
21,112,Jose Manuel,Urman,JMURMAN,515.124.4469,07-MAR-06,FI_ACCOUNT,7800,108,100
22,113,Luis,Popp,LPOPP,515.124.4567,07-DEC-07,FI_ACCOUNT,6900,108,100
23,114,Den,Raphaely,DRAPHEAL,515.127.4561,07-DEC-02,PU_MAN,11000,100,30
29,120,Matthew,Weiss,MWEISS,650.123.1234,18-JUL-04,ST_MAN,8000,100,50
30,121,Adam,Fripp,AFRIPP,650.123.2234,10-APR-05,ST_MAN,8200,100,50
31,122,Payam,Kaufling,PKAUFLIN,650.123.3234,01-MAY-03,ST_MAN,7900,100,50
32,123,Shanta,Vollman,SVOLLMAN,650.123.4234,10-OCT-05,ST_MAN,6500,100,50

#### b. Get the total count of records that have salary > 6000

In [255]:
# we have put the condition inside the loc[] and based on EMPLOYEE_ID, We do total count
data.loc[data['SALARY']>6000]['EMPLOYEE_ID'].count()

20

#### Scenario 3:  which kind of jobs are having more than 10000 salary

In [256]:
new1 = data.loc[data['SALARY']>10000,['SALARY','DEPARTMENT_ID','JOB_ID']]
new1

    SALARY  DEPARTMENT_ID   JOB_ID
3    13000             20   MK_MAN
7    12008            110   AC_MGR
9    24000             90  AD_PRES
10   17000             90    AD_VP
11   17000             90    AD_VP
17   12008            100   FI_MGR
23   11000             30   PU_MAN

#### Scenario 3: Get  the record that have salary less than 6000 and Department id,JOB_ID  or Which Department's  and JOB's employees are having less than 6000 salary

In [257]:
new2 = data.loc[data['SALARY']<6000,['SALARY','DEPARTMENT_ID','JOB_ID']]
new2.head()

    SALARY  DEPARTMENT_ID    JOB_ID
0     2600             50  SH_CLERK
1     2600             50  SH_CLERK
2     4400             10   AD_ASST
14    4800             60   IT_PROG
15    4800             60   IT_PROG

In [258]:
# find total records of above scenario
new2['DEPARTMENT_ID'].count()

28

In [259]:
# Return the records with First name and Salary
data.loc[:,['FIRST_NAME','SALARY']].head(10)

  FIRST_NAME  SALARY
0     Donald    2600
1    Douglas    2600
2   Jennifer    4400
3    Michael   13000
4        Pat    6000
5      Susan    6500
6    Hermann   10000
7    Shelley   12008
8    William    8300
9     Steven   24000

#### Apply Lambda function to Pandas.

#### 1. Syntax to apply lambda function on series:
      
      series.apply(lambda x:expression)
#### 2. Syntax to apply lambda function on dataframe
    
      df.apply(lambda x: expression)
     
#### 3. We can also use assign() method on dataframe for applying lambda

       df.assign(new_column_name = lambda x : expression)
       
#### 4. Apply lambda function on pandas column
      df['new_column'] = df['original_column'].apply(lamnda x: expression)
      
#### 5. Apply lambda on Multiple column
      df[['new_column1','new_column2']] = df[['original_col_name1, 'original_col_name2]].apply(lambda x : expression,axis=1)
      
      
#### 6. Reference of lambda function
https://www.geeksforgeeks.org/applying-lambda-functions-to-pandas-dataframe/?re

In [260]:
df = {'Name':['Alice','Bob','Charlie','David'],'Age':[32,24,51,67],'City':['New York','Los Angeles','Chicago','Houseton']}

data1 = pd.DataFrame(df)
data1.head()

      Name  Age         City
0    Alice   32     New York
1      Bob   24  Los Angeles
2  Charlie   51      Chicago
3    David   67     Houseton

In [261]:
data1[['Total Name Age']] = data1[['Name','Age']].apply(lambda x: x['Name'] + ' '+ str(x['Age']), axis=1)

print(data1)

      Name  Age         City Total Name Age
0    Alice   32     New York       Alice 32
1      Bob   24  Los Angeles         Bob 24
2  Charlie   51      Chicago     Charlie 51
3    David   67     Houseton       David 67

In [262]:
## Apply lambda function  if-else condition
data1['Age Category'] = data1['Age'].apply(lambda x: 'Child' if x < 18 else 'Adult' if x < 65 else 'Senior')
print(data1)

      Name  Age         City Total Name Age Age Category
0    Alice   32     New York       Alice 32        Adult
1      Bob   24  Los Angeles         Bob 24        Adult
2  Charlie   51      Chicago     Charlie 51        Adult
3    David   67     Houseton       David 67       Senior

In [263]:
#### we need to set salary 20000 as threshold that if salary is greater than 24000 set to fair otherwise survival

data['Salary Category'] = data['SALARY'].apply(lambda x : 'fair' if x>20000 else 'Survival')
data.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID,Salary Category
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,124,50,Survival
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,124,50,Survival
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,101,10,Survival
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,100,20,Survival
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,201,20,Survival

###  Which Job_id  is having highest salary

In [264]:
highest_job_id = data['JOB_ID'][data['SALARY']==data['SALARY'].max()]
highest_job_id

9    AD_PRES
Name: JOB_ID, dtype: object

### Which Job_id is having lowest salary

In [265]:
lowest_job_id = data['JOB_ID'][data['SALARY']== data['SALARY'].min()]
lowest_job_id

41    ST_CLERK
Name: JOB_ID, dtype: object

### Get the number of characters of FIRST_NAME column

In [266]:
data['characters_count'] = data['FIRST_NAME'].apply(lambda x : len(x))

In [267]:
data.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID,Salary Category,characters_count
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,124,50,Survival,6
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,124,50,Survival,7
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,101,10,Survival,8
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,100,20,Survival,7
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,201,20,Survival,3

In [268]:
df = pd.read_csv('Salary_Data.csv')

In [269]:
df.head()

   YearsExperience   Age  Salary
0              1.1  21.0   39343
1              1.3  21.5   46205
2              1.5  21.7   37731
3              2.0  22.0   43525
4              2.2  22.2   39891

#### Find the data between Salary 25k to 50k

In [270]:
# make the bool series
bool_series = df['Salary'].between(25000,50000)

# returning data frame with salary between above range values
df[bool_series]

   YearsExperience   Age  Salary
0              1.1  21.0   39343
1              1.3  21.5   46205
2              1.5  21.7   37731
3              2.0  22.0   43525
4              2.2  22.2   39891

#### Get the size of data

In [271]:
df.shape

(30, 3)

### Get  the highest salary

In [272]:
highest_salary = df[df['Salary']==df['Salary'].max()]
print(highest_salary)

    YearsExperience   Age  Salary
28             10.3  37.0  122391

### Get the lowest Salary

In [273]:
lowest_salary = df[df['Salary']==df['Salary'].min()]
print(lowest_salary)

   YearsExperience   Age  Salary
2              1.5  21.7   37731

### Operations

In [274]:
df['Salary Category'] = df['Salary'].apply(lambda x : 'low' if x < 37000 else 'Normal' if x < 50000 else 'High' )
df.head()

   YearsExperience   Age  Salary Salary Category
0              1.1  21.0   39343          Normal
1              1.3  21.5   46205          Normal
2              1.5  21.7   37731          Normal
3              2.0  22.0   43525          Normal
4              2.2  22.2   39891          Normal

#### Need to get if there is low salary in Salary category?

In [275]:
new = df['Salary Category'].isin(['low'])
df[new]

Empty DataFrame
Columns: [YearsExperience, Age, Salary, Salary Category]
Index: []

#### Aggregating Data Across All Columns : aggregation works with only  numeric type  columns

In [276]:
df.iloc[:,0:3].aggregate(['sum','min'])

     YearsExperience    Age   Salary
sum            159.4  816.5  2280090
min              1.1   21.0    37731

In [277]:
## mad (mean absolute value)

df.mad(axis=0)

YearsExperience        2.382667
Age                    4.426667
Salary             24290.466667
dtype: float64

In [278]:
## Sum of Salary
sum(df['Salary'])

2280090

In [279]:
df.head()

   YearsExperience   Age  Salary Salary Category
0              1.1  21.0   39343          Normal
1              1.3  21.5   46205          Normal
2              1.5  21.7   37731          Normal
3              2.0  22.0   43525          Normal
4              2.2  22.2   39891          Normal

### How many employees have Normal salary

In [280]:
normal_salary_cnt = df[df['Salary Category']=='Normal']['Salary'].count()
print(normal_salary_cnt)

5

In [281]:
#### different way of above code
normal_sal_cnt1 = df[df['Salary Category']=='Normal'].shape[0]
print(normal_sal_cnt1)

5

### How many employees have High salary

In [282]:
high_salary_cnt = df[df['Salary Category']=='High']['Salary'].count()
print(high_salary_cnt)

25

In [283]:
high_salary_cnt = df[df['Salary Category']=='High'].shape[0]
print(high_salary_cnt)

25

###  Read bollywood moviedetails data

In [284]:
movies = pd.read_csv('BollywoodMovieDetail.csv')

In [285]:
movies.head()

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
0,tt0118578,Albela,2001,20 Apr 2001,Romance,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...,Deepak Sareen,0.0,2
1,tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6
2,tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1
3,tt0222024,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4
4,tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1

In [286]:
movies['hitFlop'].value_counts()

1    729
2    257
4     68
6     64
5     58
3     55
7     29
8     20
9      4
Name: hitFlop, dtype: int64

#### Total number of movies which release in 2001 and 2002

In [287]:
movies['releaseYear'].value_counts()

2010    116
2011    112
2014    110
2005    106
2013    102
2012     99
2008     98
2003     95
2009     91
2004     88
2002     79
2007     66
2001     62
2006     60
Name: releaseYear, dtype: int64

#### Total Movies in year  of 2001 and 2004

In [288]:
movies[(movies['releaseYear']==2001) | (movies['releaseYear'] == 2004)].shape[0]

150

#### Which director's movies is hit?

In [289]:
# 1. we categorize hit or flop movie

movies['category'] = movies['hitFlop'].apply(lambda x: 'hit' if x>=7 else 'Flop')
movies.head(10)

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop,category
0,tt0118578,Albela,2001,20 Apr 2001,Romance,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...,Deepak Sareen,0.0,2,Flop
1,tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6,Flop
2,tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1,Flop
3,tt0222024,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4,Flop
4,tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1,Flop
5,tt0238936,Devdas,2002,12 Jul 2002,Musical | Romance,Saratchandra Chatterjee (based on the novel by...,Shah Rukh Khan | Madhuri Dixit | Aishwarya Rai...,Sanjay Leela Bhansali,0.0,6,Flop
6,tt0247911,Aap Mujhe Achche Lagne Lage,2002,19 Apr 2002,Action | Drama | Romance,Robin Bhatt (story) | Girish Dhamija (dialogue...,Hrithik Roshan | Ameesha Patel | Kiran Kumar |...,Vikram Bhatt,0.0,2,Flop
7,tt0248126,Kabhi Khushi Kabhie Gham...,2001,14 Dec 2001,Drama | Musical | Romance,Karan Johar | Sheena Parikh (screenplay),Amitabh Bachchan | Jaya Bhaduri | Shah Rukh Kh...,Karan Johar,0.0,8,hit
8,tt0248216,Na Tum Jaano Na Hum,2002,10 May 2002,Comedy | Drama | Musical,Pratibha Acharya (dialogue) | Arjun Sablok,Saif Ali Khan | Hrithik Roshan | Esha Deol | A...,Arjun Sablok,0.0,1,Flop
9,tt0248617,Yaadein...,2001,27 Jun 2001,Musical | Drama | Romance,Subhash Ghai (dialogue) | Subhash Ghai (screen...,Jackie Shroff | Hrithik Roshan | Kareena Kapoo...,Subhash Ghai,0.0,2,Flop

In [290]:
director_names = movies[movies['category']=='hit']['directors']
director_names = director_names.reset_index(drop=True)
print(director_names)

0                  Karan Johar
1                  Anil Sharma
2               Satish Kaushik
3                  Anurag Basu
4                  Neeraj Vora
5                  Yash Chopra
6                Sanjay Gadhvi
7                Rakesh Roshan
8                  Kunal Kohli
9                Sanjay Gadhvi
10                   Shaad Ali
11                Anees Bazmee
12             Rajkumar Hirani
13              Abbas Tyrewala
14                Priyadarshan
15                Anees Bazmee
16          Sooraj R. Barjatya
17                David Dhawan
18    Aamir Khan | Amole Gupte
19                  Farah Khan
20               Rakesh Roshan
21                Anees Bazmee
22             A.R. Murugadoss
23               Aditya Chopra
24             Rajkumar Hirani
25              Kunal Deshmukh
26           Rajkumar Santoshi
27                 Prakash Jha
28                Rohit Shetty
29             Abhinav Kashyap
30                Anees Bazmee
31                    Siddique
32       Vijay Krishna Acharya
33              Karan Malhotra
34                  Mohit Suri
35                Rohit Shetty
36               Milan Luthria
37                  Sajid Khan
38                  Kabir Khan
39                 Prabhudheva
40                 Anurag Basu
41                Rohit Shetty
42                 Arbaaz Khan
43                Vikram Bhatt
44              Ayan Mukherjee
45                  Mohit Suri
46                Rohit Shetty
47             Rajkumar Hirani
48     Rakeysh Omprakash Mehra
49            Sajid Nadiadwala
50             Abhishek Varman
51                  Farah Khan
52                 Indra Kumar
Name: directors, dtype: object

### Find the movies directed by "sanjay Leela Bhanshali"

In [291]:
movies[(movies['directors']=='Sanjay Leela Bhansali')].shape[0]

5

####  List of Movies name which are released in 2009

In [292]:
df = movies[movies['releaseYear']==2009]
df.reset_index()

,index,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop,category
0,319,tt0438894,Kisse Pyaar Karo?n,2009,27 Feb 2009,Action | Comedy | Crime,Shabbir Ahmed (lyrics) | Yunus Sajawal (screen...,Arshad Warsi | Aashish Chaudhary | Yash Tonk |...,Ajay Chandhok,0.0,1,Flop
1,435,tt0486615,London Dreams,2009,30 Oct 2009,Musical,Ritesh Shah (dialogue) | Suresh Nair (story),Salman Khan | Om Puri | Ajay Devgn | Dilyana B...,Vipul Amrutlal Shah,0.0,2,Flop
2,518,tt0886539,Luck by Chance,2009,30 Jan 2009,Drama,Zoya Akhtar (story) | Javed Akhtar (dialogue),Farhan Akhtar | Konkona Sen Sharma | Rishi Kap...,Zoya Akhtar,0.0,2,Flop
3,521,tt0893585,Detective Naani,2009,22 May 2009,Crime | Drama | Family,Romilla Mukherjee,Ava Mukherjee | Zain Khan | Simran Singh | Amr...,Romilla Mukherjee,0.0,1,Flop
4,559,tt1043451,Delhi-6,2009,20 Feb 2009,Comedy | Drama,Rakeysh Omprakash Mehra (story) | Prasoon Josh...,Waheeda Rehman | Abhishek Bachchan | Sonam Kap...,Rakeysh Omprakash Mehra,0.0,2,Flop
...,...,...,...,...,...,...,...,...,...,...,...,...
86,968,tt1995257,Bachelor Party,2009,04 Sep 2009,Comedy | Drama,Arun Bhairav (script) | Raghuvir Shekhawat (sc...,Jimmy Shergill | Arbaaz Khan | Nauheed Cyrusi ...,Ishaan Trivedi,0.0,1,Flop
87,986,tt2058651,Maruti Mera Dosst,2009,05 Jun 2009,Animation | Adventure | Drama,Mann Katoja | Manikya Raju,Shahbaaz Khan | Sushmita Mukherjee | Erik A. N...,Manikya Raju,0.0,1,Flop
88,990,tt2064852,Lottery,2009,20 Mar 2009,Crime | Drama | Mystery,Aadesh K. Arjun (dialogue) | Hemant Prabhu (sc...,Abhijeet | Rucha Gujrati | Manisha Kelkar | Na...,Hemant Prabhu,0.0,1,Flop
89,992,tt2066899,Jugaad,2009,13 Feb 2009,Comedy | Drama,Priyank Dubey (screenplay) | Bunty Rathore (sc...,Manoj Bajpayee | Hrishitaa Bhatt | Vijay Raaz ...,R. Anand Kumar,0.0,1,Flop
90,1011,tt2138010,3 Nights 4 Days,2009,09 Oct 2009,Romance,NaN,Hrishitaa Bhatt | Anuj Sawhney,Devang Dholakia,0.0,1,Flop

In [293]:
# last 5 data using slice
movies[-5:]

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop,category
1279,tt4121522,Shuruaat Ka Interval,2014,15 Aug 2014,NaN,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,Kaivalya Chheda | Rajsekhar Aningi | Avidant B...,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,0.0,1,Flop
1280,tt4187650,Trip to Bhangarh,2014,28 Aug 2014,Horror,NaN,Manish Choudhary | Suzanna Mukherjee | Poonam ...,Jitendra Pawar,0.0,1,Flop
1281,tt4190220,Zed Plus,2014,28 Nov 2014,NaN,Chandra Prakash Dwivedi (screen play and dialo...,Adil Hussain | Ekavali Khanna | Kulbhushan Kha...,Chandra Prakash Dwivedi,0.0,1,Flop
1282,tt4219300,Gollu aur Pappu,2014,21 Nov 2014,Comedy,NaN,Vir Das | Sandeepa Dhar | Rahul Handa | Dimple...,Kabir Sadanand,0.0,1,Flop
1283,tt4228746,Zid,2014,28 Nov 2014,Thriller,Vivek Agnihotri | Rohit Malhotra,Shradha Das | Mohan Kapoor | Mannara | Karanvi...,Rohit Malhotra | Anubhav Sinha,0.0,2,Flop

### Series Indexing : truncate() function to truncate some data from the series  prior to a given index and after a given index label

In [294]:
sr = pd.Series([19.5,16.9,13.4,12.7,11.90,25,27.9,26.8])
print(sr)

0    19.5
1    16.9
2    13.4
3    12.7
4    11.9
5    25.0
6    27.9
7    26.8
dtype: float64

In [295]:
sr.truncate(before=1,after=3)

1    16.9
2    13.4
3    12.7
dtype: float64

 ###  Accessing First Five Element  From Series

In [296]:
sr[:5]

0    19.5
1    16.9
2    13.4
3    12.7
4    11.9
dtype: float64

### Concatenate two dataFrame

In [297]:
data_frame = pd.concat([data,movies],axis=1)

In [298]:
data_frame.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID,...,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop,category
0,198.0,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600.0,124,50.0,...,Albela,2001,20 Apr 2001,Romance,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...,Deepak Sareen,0.0,2,Flop
1,199.0,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600.0,124,50.0,...,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6,Flop
2,200.0,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400.0,101,10.0,...,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1,Flop
3,201.0,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000.0,100,20.0,...,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4,Flop
4,202.0,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000.0,201,20.0,...,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1,Flop

In [299]:
data_frame.shape

(1284, 23)

####  Working With Date and Time

In [303]:
from datetime import date
d = date(2024,5,15)
print(d)
print(type(d))

2024-05-15
<class 'datetime.date'>

In [304]:
#creating the Timestamp Object

timestamp = pd.Timestamp('2024-05-15 13:52:00')

# extracting the year from timestamp

year = timestamp.year

print(year)

# extracting the month from timestamp

month = timestamp.month

print(month)

# extracting the day from timestamp

day = timestamp.day

print(day)

2024
5
15

In [306]:
# extracting the hour
hour = timestamp.hour
print(hour)

# extracting the minute

minute = timestamp.minute

print(minute)

# extracting the weekday

weekday = timestamp.weekday()
print(weekday)

# extracting the quarter

quarter = timestamp.quarter

print(quarter)

13
52
2
2

In [312]:
# get the current time
import warnings
warnings.filterwarnings('ignore')
from datetime import datetime
x = pd.datetime.now()
print(x)

# extracting the month
print(x.month)

# extracting the year
print(x.year)

2024-05-15 14:44:39.532200
5
2024

In [313]:
#convert timestamp to unix time
unix_time = timestamp.timestamp()
print("unix_time: {}".format(unix_time))

unix_time: 1715781120.0

In [319]:
# convert timestamp with time zone to unix timestamp.

timestamp_with_tz = pd.Timestamp("2023-01-15 10:30:00", tz="Asia/Tokyo")
unix_time = timestamp_with_tz.timestamp()
print(unix_time)

1673746200.0

In [323]:
# Generate Timestamps for the last 5 days

timestamps = pd.date_range(end = pd.Timestamp.now(),periods = 5, freq = "D")

# create Dataframe with timestamped data

data = pd.DataFrame({'timestamps':timestamps,'temprature':[21.2,20.5,32.7,27.5,35.6]})

data

                  timestamps  temprature
0 2024-05-11 16:41:01.022825        21.2
1 2024-05-12 16:41:01.022825        20.5
2 2024-05-13 16:41:01.022825        32.7
3 2024-05-14 16:41:01.022825        27.5
4 2024-05-15 16:41:01.022825        35.6

In [324]:
# Generate Timestamps for the last 5 days

timestamps = pd.date_range(start = pd.Timestamp.now(),periods = 5, freq = "D")

# create Dataframe with timestamped data

data = pd.DataFrame({'timestamps':timestamps,'temprature':[21.2,20.5,32.7,27.5,35.6]})

data

                  timestamps  temprature
0 2024-05-15 16:43:50.412814        21.2
1 2024-05-16 16:43:50.412814        20.5
2 2024-05-17 16:43:50.412814        32.7
3 2024-05-18 16:43:50.412814        27.5
4 2024-05-19 16:43:50.412814        35.6

#### Timestamp replace()

In [325]:
# create timestamp object
timestamp = pd.Timestamp("2022-06-15 12:30:00")

# replace the year and month
modified_timestamp = timestamp.replace(year=2023, month = 10)

print("Org Timestamp : {}".format(timestamp))
print("modified Timestamp: {}".format(modified_timestamp))

Org Timestamp : 2022-06-15 12:30:00
modified Timestamp: 2023-10-15 12:30:00

#### Pandas to_datetime() function is used to convert different datatypes to datetime datatype

In [332]:


# date string
d_string = "2023-09-17 14:30:00"

# Convert the string to datetime
dt_obj = pd.to_datetime(d_string)

print(dt_obj)

2023-09-17 14:30:00

In [333]:
# simple numerical values representing seconds since the Unix epoch

unix_time = 1721700500

# convert the unix_time into datetime using s(second) as unit

dt_obj = pd.to_datetime(unix_time,unit ='s')

print(dt_obj)

2024-07-23 02:08:20

#### Sliding Window Concept: it decides the number of elements in the subsets.Sliding window is a subset of a data structure of a given point

#### We don't want any windows with elements less than our window size. In this case, the window size = 3 . In this case, we make small change in our code to stop iteration when we reach the window size

In [4]:
lst = [1,2,3,4,5,6,7,8]

def sliding(elements,window_size):
    
    if len(elements)<=window_size:
        return elements
    for i in range(len(elements)):
        print(lst[i:i+window_size])

def sliding1(lst,window_size):
    print("calling from sliding1:")
    if len(lst)<=window_size:
        return lst
    for i in range(len(lst)-window_size+1):
        print(lst[i:i+window_size])

sliding(lst,3)
sliding1(lst,3)

[1, 2, 3]
[2, 3, 4]
[3, 4, 5]
[4, 5, 6]
[5, 6, 7]
[6, 7, 8]
[7, 8]
[8]
calling from sliding1:
[1, 2, 3]
[2, 3, 4]
[3, 4, 5]
[4, 5, 6]
[5, 6, 7]
[6, 7, 8]

### Sliding window to calculate substring

In [6]:
s = "eidbaooo"

def substring_bysliding_window(s,window_size):
    if len(s)<=window_size:
        return s
    for i in range(len(s)-window_size+1):
        print(s[i:i+window_size])

substring_bysliding_window(s,2)

ei
id
db
ba
ao
oo
oo

In [13]:
import pandas as pd

# Create a pandas series
ts = pd.Series(range(0, 40, 2))

# print the series

print("Pandas series:\n",ts)
# creating the rolling window of size 5 and clculating the mean
rolling_mean = ts.rolling(window=5).mean()

# print the rolling_mean

print(rolling_mean)

Pandas series:
 0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
11    22
12    24
13    26
14    28
15    30
16    32
17    34
18    36
19    38
dtype: int64
0      NaN
1      NaN
2      NaN
3      NaN
4      4.0
5      6.0
6      8.0
7     10.0
8     12.0
9     14.0
10    16.0
11    18.0
12    20.0
13    22.0
14    24.0
15    26.0
16    28.0
17    30.0
18    32.0
19    34.0
dtype: float64